Revit 2027 API
FaceWall.IsWallTypeValidForFaceWall Method
 Identifies if a wall type may be applied to a face wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsWallTypeValidForFaceWall(
	Document document,
	ElementId wallType
)
Public Shared Function IsWallTypeValidForFaceWall (
	document As Document,
	wallType As ElementId
) As Boolean
public:
static bool IsWallTypeValidForFaceWall(
	Document^ document,
	ElementId^ wallType
)
static member IsWallTypeValidForFaceWall :
        document : Document *
        wallType : ElementId -> bool
Parameters
document Document
 The document.
wallType ElementId
 The wall type.
Return Value
Boolean
 True if the wall type is valid for face wall, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FaceWall Class
Autodesk.Revit.DB Namespace